tuts/1D_C7H16_LU_premixed_inletoutlet/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`
runApplication blockMesh
runApplication $application
paraFoam
